<img src=https://static.wixstatic.com/media/f6bd9a_6a972d9b31324653bf198c38ce94339e~mv2.png>

# Carrusel de RDBMS
## Ejercicios de SQL resueltos

En este cuaderno resuelvo alguno de los ejercicios del documento: 'Desarrollo de Aplicaciones en Entornos de Cuarta Generación y Herramientas CASE: Ejercicios de SQL.'

Para ello utilizo una version de la base de datos -que nombre "practicas_hospital"- modificada para ser compatible en esta ocasion, para **MS ACCESS**, siguiendo la estructura del libro.


Tanto el diagrama de **Entidad-Relacion**, como el **Script** para cargar la base de datos (que permite, se pueda replicar el ejercicio) en codigo VBA se encuentran disponibles en el mismo repositorio.

#### Celda para configurar el entorno

In [ ]:
# !pip install pandas
# !pip install pyodbc

#### Importamos librerias y se realiza la conexion utilizando los datos de la configuracion local de la base de datos

In [1]:
import pyodbc
import pandas as pd

# Crear la conexión
conn = pyodbc.connect(r'Driver={Microsoft Access Driver (*.mdb, *.accdb)};DBQ=C:\\Users\\ockis\\OneDrive\\Escritorio\\Nueva carpeta\\access\\practicas_hospital.accdb;')

# Crear un cursor
cursor = conn.cursor()

#### Realizamos una prueba y se Inspecciona la base de datos "practicas_hospital"

In [2]:
# Ejecutar la consulta e imprimir los resultados 
try:
    for table_info in cursor.tables(tableType='TABLE'):
        print(table_info.table_name)
    print("\nLa conexión se ha realizado con éxito.\nEstas son las tablas")
except Exception as e:
    print("\n Hubo un error al realizar la conexión:", e)

DEPARTAMENTO
DOCTOR
EMPLEADO
ENFERMO
HOSPITAL
OCUPACION
PLANTILLA
SALA

La conexión se ha realizado con éxito.
Estas son las tablas

### Resolucion de algunos ejercicios

##### 1. Encuentre a todos los miembros del personal cuyo nombre empiece por 'H'.

In [3]:
QUERY = """
SELECT APELLIDO
FROM PLANTILLA
WHERE APELLIDO LIKE 'H%';
"""
cursor.execute(QUERY)
resultados = cursor.fetchall()
df = pd.DataFrame.from_records(resultados, columns=[column[0] for column in cursor.description])
df

       APELLIDO
0  Hernandez J.
1   Higueras D.

##### 2. Quienes son las enfermeras y enfermeros que trabajan en turnos de Tarde o Mañana?

In [4]:
QUERY = """
SELECT APELLIDO, FUNCION, TURNO
FROM PLANTILLA
WHERE FUNCION LIKE 'ENFERMER%' AND TURNO IN ('T', 'M');
"""
cursor.execute(QUERY)
resultados = cursor.fetchall()
df = pd.DataFrame.from_records(resultados, columns=[column[0] for column in cursor.description])
df

       APELLIDO    FUNCION TURNO
0       Diaz B.  Enfermera     T
1  Hernandez J.  Enfermero     T
2   Higueras D.  Enfermera     T
3     Bocina G.  Enfermero     M
4     Carlos R.  Enfermera     T
5      Frank H.  Enfermera     T

##### 3. Haga un listado de las enfermeras que ganan entre 2.000.000 y 2.500.000 Pts.

In [5]:
QUERY = """
SELECT APELLIDO, FUNCION, SALARIO
FROM PLANTILLA
WHERE FUNCION IN ('ENFERMERO', 'ENFERMERA') AND (SALARIO BETWEEN 2000000 AND 2500000);
"""
cursor.execute(QUERY)
resultados = cursor.fetchall()
df = pd.DataFrame.from_records(resultados, columns=[column[0] for column in cursor.description])
df

      APELLIDO    FUNCION  SALARIO
0      Diaz B.  Enfermera  2262000
1  Higueras D.  Enfermera  2005000
2    Carlos R.  Enfermera  2119000

##### 6. Hacer un listado de los nombres de los pacientes y la posición de la primera letra 'A' que aparezca 
en su apellido, tomando como referencia la primera letra del mismo

In [6]:
QUERY = """
SELECT APELLIDO, InStr(1, UCase(APELLIDO), 'A') AS POSICION
FROM ENFERMO;
"""
cursor.execute(QUERY)
resultados = cursor.fetchall()
df = pd.DataFrame.from_records(resultados, columns=[column[0] for column in cursor.description])
df

       APELLIDO  POSICION
0     Laguia M.         2
1    Serrano V.         5
2   Fernandez M         5
3      Domin S.         0
4       Neal R.         3
5  Cervantes M.         5
6     Miller G.         0
7       Ruiz P.         0
8     Fraser A.         3
9    Benitez E.         0

##### 7. Queremos conseguir:
|COMENTARIO|
|:---------:|
|El departamento de CONTABILIDAD esta en SEVILLA|
|El departamento de INVESTIGACIÓN esta en MADRID|
|El departamento de VENTAS esta en BARCELONA|
|El departamento de PRODUCCIÓN esta en BILBAO|

In [7]:
QUERY = """
SELECT 'El departamento de ' & DNOMBRE & ' se encuentra en  ' & LOC AS COMENTARIO 
FROM DEPARTAMENTO;
"""
cursor.execute(QUERY)
resultados = cursor.fetchall()
df = pd.DataFrame.from_records(resultados, columns=[column[0] for column in cursor.description])
pd.set_option('display.max_colwidth', None)
df

                                                 COMENTARIO
0   El departamento de CONTABILIDAD se encuentra en  MADRID
1  El departamento de INVESTIGACIÓN se encuentra en  BILBAO
2        El departamento de VENTAS se encuentra en  SEVILLA
3    El departamento de OPERACIONES se encuentra en  MALAGA

In [8]:
# Cierra la conexión
conn.close()

# Autor
### Oscar Gutierrez Leal
28 - 03 - 2024